In [1]:
import os
import sys

os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable

import findspark
findspark.init()
findspark.find()
import pyspark

from pyspark.sql import SparkSession
from pyspark import SparkContext, SparkConf
from pyspark.sql import SQLContext

conf = pyspark.SparkConf().setAppName('appName').setMaster('local')
sc = pyspark.SparkContext(conf=conf)
spark = SparkSession(sc)
sqlcontext=SQLContext(sc)

In [20]:
df=spark.read.csv("sampledata.csv",header=True,inferSchema=True)
df.show()

+-------+----+----------+------+------------+
|   Name| Age|Experience|Salary|  Department|
+-------+----+----------+------+------------+
|    Bob|  24|         3|  2500|          HR|
|  erwin|  28|         5|  5000|Data Analyst|
|rebecca|  29|         2|  3000|    Networks|
|   john|  35|        10|  7000|Web Analysis|
|michael|  22|         1|  2000|Web Analysis|
|    Dan|  24|         2| 10000|Data Analyst|
| mahesg|  27|         6|  6000|          HR|
|  aslam|  39|        12|  null|    Networks|
|  randy|null|         4|  null|    Networks|
|  clive|  28|         5|  8000|Data Analyst|
|   brad|  33|         8| 13000|        null|
|   eric|  23|         2|  5000|        null|
|   null|null|      null|  null|        null|
+-------+----+----------+------+------------+

In [21]:
#dropping a column 
df.drop("Department").show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|    Bob|  24|         3|  2500|
|  erwin|  28|         5|  5000|
|rebecca|  29|         2|  3000|
|   john|  35|        10|  7000|
|michael|  22|         1|  2000|
|    Dan|  24|         2| 10000|
| mahesg|  27|         6|  6000|
|  aslam|  39|        12|  null|
|  randy|null|         4|  null|
|  clive|  28|         5|  8000|
|   brad|  33|         8| 13000|
|   eric|  23|         2|  5000|
|   null|null|      null|  null|
+-------+----+----------+------+

In [22]:
df.show()

+-------+----+----------+------+------------+
|   Name| Age|Experience|Salary|  Department|
+-------+----+----------+------+------------+
|    Bob|  24|         3|  2500|          HR|
|  erwin|  28|         5|  5000|Data Analyst|
|rebecca|  29|         2|  3000|    Networks|
|   john|  35|        10|  7000|Web Analysis|
|michael|  22|         1|  2000|Web Analysis|
|    Dan|  24|         2| 10000|Data Analyst|
| mahesg|  27|         6|  6000|          HR|
|  aslam|  39|        12|  null|    Networks|
|  randy|null|         4|  null|    Networks|
|  clive|  28|         5|  8000|Data Analyst|
|   brad|  33|         8| 13000|        null|
|   eric|  23|         2|  5000|        null|
|   null|null|      null|  null|        null|
+-------+----+----------+------+------------+

In [23]:
#dropping "any" rows with null value/ drops all those rows having a null value
df.na.drop("any").show()

+-------+---+----------+------+------------+
|   Name|Age|Experience|Salary|  Department|
+-------+---+----------+------+------------+
|    Bob| 24|         3|  2500|          HR|
|  erwin| 28|         5|  5000|Data Analyst|
|rebecca| 29|         2|  3000|    Networks|
|   john| 35|        10|  7000|Web Analysis|
|michael| 22|         1|  2000|Web Analysis|
|    Dan| 24|         2| 10000|Data Analyst|
| mahesg| 27|         6|  6000|          HR|
|  clive| 28|         5|  8000|Data Analyst|
+-------+---+----------+------+------------+

In [24]:
df.show()

+-------+----+----------+------+------------+
|   Name| Age|Experience|Salary|  Department|
+-------+----+----------+------+------------+
|    Bob|  24|         3|  2500|          HR|
|  erwin|  28|         5|  5000|Data Analyst|
|rebecca|  29|         2|  3000|    Networks|
|   john|  35|        10|  7000|Web Analysis|
|michael|  22|         1|  2000|Web Analysis|
|    Dan|  24|         2| 10000|Data Analyst|
| mahesg|  27|         6|  6000|          HR|
|  aslam|  39|        12|  null|    Networks|
|  randy|null|         4|  null|    Networks|
|  clive|  28|         5|  8000|Data Analyst|
|   brad|  33|         8| 13000|        null|
|   eric|  23|         2|  5000|        null|
|   null|null|      null|  null|        null|
+-------+----+----------+------+------------+

In [27]:
#Dropping only those rows with all null values
df.na.drop("all").show()

+-------+----+----------+------+------------+
|   Name| Age|Experience|Salary|  Department|
+-------+----+----------+------+------------+
|    Bob|  24|         3|  2500|          HR|
|  erwin|  28|         5|  5000|Data Analyst|
|rebecca|  29|         2|  3000|    Networks|
|   john|  35|        10|  7000|Web Analysis|
|michael|  22|         1|  2000|Web Analysis|
|    Dan|  24|         2| 10000|Data Analyst|
| mahesg|  27|         6|  6000|          HR|
|  aslam|  39|        12|  null|    Networks|
|  randy|null|         4|  null|    Networks|
|  clive|  28|         5|  8000|Data Analyst|
|   brad|  33|         8| 13000|        null|
|   eric|  23|         2|  5000|        null|
+-------+----+----------+------+------------+

In [29]:
# dropping rows based on null values in a specific column
df.na.drop(subset=["Department","Age"]).show()

+-------+---+----------+------+------------+
|   Name|Age|Experience|Salary|  Department|
+-------+---+----------+------+------------+
|    Bob| 24|         3|  2500|          HR|
|  erwin| 28|         5|  5000|Data Analyst|
|rebecca| 29|         2|  3000|    Networks|
|   john| 35|        10|  7000|Web Analysis|
|michael| 22|         1|  2000|Web Analysis|
|    Dan| 24|         2| 10000|Data Analyst|
| mahesg| 27|         6|  6000|          HR|
|  aslam| 39|        12|  null|    Networks|
|  clive| 28|         5|  8000|Data Analyst|
+-------+---+----------+------+------------+

In [49]:
df.show()

+-------+----+----------+------+------------+
|   Name| Age|Experience|Salary|  Department|
+-------+----+----------+------+------------+
|    Bob|  24|         3|  2500|          HR|
|  erwin|  28|         5|  5000|Data Analyst|
|rebecca|  29|         2|  3000|    Networks|
|   john|  35|        10|  7000|Web Analysis|
|michael|  22|         1|  2000|Web Analysis|
|    Dan|  24|         2| 10000|Data Analyst|
| mahesg|  27|         6|  6000|          HR|
|  aslam|  39|        12|  null|    Networks|
|  randy|null|         4|  null|    Networks|
|  clive|  28|         5|  8000|Data Analyst|
|   brad|  33|         8| 13000|        null|
|   eric|  23|         2|  5000|        null|
|   null|null|      null|  null|        null|
+-------+----+----------+------+------------+

In [51]:
df.na.fill({"Name":"unknown","Age":0,"Experience":0,"Salary":500,"Department":"intern"}).show()

+-------+---+----------+------+------------+
|   Name|Age|Experience|Salary|  Department|
+-------+---+----------+------+------------+
|    Bob| 24|         3|  2500|          HR|
|  erwin| 28|         5|  5000|Data Analyst|
|rebecca| 29|         2|  3000|    Networks|
|   john| 35|        10|  7000|Web Analysis|
|michael| 22|         1|  2000|Web Analysis|
|    Dan| 24|         2| 10000|Data Analyst|
| mahesg| 27|         6|  6000|          HR|
|  aslam| 39|        12|   500|    Networks|
|  randy|  0|         4|   500|    Networks|
|  clive| 28|         5|  8000|Data Analyst|
|   brad| 33|         8| 13000|      intern|
|   eric| 23|         2|  5000|      intern|
|unknown|  0|         0|   500|      intern|
+-------+---+----------+------+------------+

In [52]:
busDf=spark.read.csv("bus-breakdown-and-delays.csv",header=True,inferSchema=True)
busDf.show(5)

+-----------+---------------+-----------------+------+------------+-------------+----------------+-------------------+----------+
|School_Year|Busbreakdown_ID|         Run_Type|Bus_No|Route_Number|       Reason|Schools_Serviced|        Occurred_On|      Town|
+-----------+---------------+-----------------+------+------------+-------------+----------------+-------------------+----------+
|  2015-2016|        1227538|Special Ed AM Run|  2621|        J711|Heavy Traffic|           75003|2015-11-05 08:10:00|New Jersey|
|  2015-2016|        1227539|Special Ed AM Run|  1260|        M351|Heavy Traffic|            6716|2015-11-05 08:10:00| Manhattan|
|  2015-2016|        1227540|         Pre-K/EI|   418|           3|Heavy Traffic|            C445|2015-11-05 08:09:00|     Bronx|
|  2015-2016|        1227541|Special Ed AM Run|  4522|        M271|Heavy Traffic|            2699|2015-11-05 08:12:00| Manhattan|
|  2015-2016|        1227542|Special Ed AM Run|  3124|        M373|Heavy Traffic|            2116|2015-11-05 08:13:00| Manhattan|
+-----------+---------------+-----------------+------+------------+-------------+----------------+-------------------+----------+
only showing top 5 rows

In [55]:
busDf=busDf.drop("Reason")
busDf.show(5)

+-----------+---------------+-----------------+------+------------+----------------+-------------------+----------+
|School_Year|Busbreakdown_ID|         Run_Type|Bus_No|Route_Number|Schools_Serviced|        Occurred_On|      Town|
+-----------+---------------+-----------------+------+------------+----------------+-------------------+----------+
|  2015-2016|        1227538|Special Ed AM Run|  2621|        J711|           75003|2015-11-05 08:10:00|New Jersey|
|  2015-2016|        1227539|Special Ed AM Run|  1260|        M351|            6716|2015-11-05 08:10:00| Manhattan|
|  2015-2016|        1227540|         Pre-K/EI|   418|           3|            C445|2015-11-05 08:09:00|     Bronx|
|  2015-2016|        1227541|Special Ed AM Run|  4522|        M271|            2699|2015-11-05 08:12:00| Manhattan|
|  2015-2016|        1227542|Special Ed AM Run|  3124|        M373|            2116|2015-11-05 08:13:00| Manhattan|
+-----------+---------------+-----------------+------+------------+----------------+-------------------+----------+
only showing top 5 rows

In [57]:
#Question 1
busDf=busDf.na.fill("Other",subset=["Town"])

In [58]:
#Question 2
busDf=busDf.na.drop("any",subset=["Occurred_On"])

In [59]:
#Question 3
busDf=busDf.na.fill(0,subset=["Route_Number"])

In [61]:
busDf.columns

['School_Year',
 'Busbreakdown_ID',
 'Run_Type',
 'Bus_No',
 'Route_Number',
 'Schools_Serviced',
 'Occurred_On',
 'Town']

In [62]:
#Question 4
busDf.select("Busbreakdown_ID").count()

379412

In [63]:
busDf.groupBy("Town").agg({"Busbreakdown_ID":"count"}).show()

+---------------+----------------------+
|           Town|count(Busbreakdown_ID)|
+---------------+----------------------+
|         Queens|                 52072|
|  Nassau County|                  8267|
|    Connecticut|                   237|
|          Other|                 11095|
|       Brooklyn|                 85909|
|   All Boroughs|                   634|
|  Staten Island|                 16169|
|    Westchester|                  8448|
|     New Jersey|                  1979|
|Rockland County|                   973|
|      Manhattan|                 99473|
|          Bronx|                 94156|
+---------------+----------------------+

In [65]:
busDf.groupBy("Route_Number").agg({"Busbreakdown_ID":"count"}).show()

+------------+----------------------+
|Route_Number|count(Busbreakdown_ID)|
+------------+----------------------+
|        M576|                    54|
|        Q357|                    21|
|        Q346|                    18|
|        M238|                    74|
|        K246|                   133|
|        X291|                    29|
|        W901|                    23|
|        W933|                    33|
|        L010|                    39|
|        P551|                    12|
|        P110|                   174|
|        Q076|                   117|
|        Q373|                    31|
|        P562|                    46|
|        Y730|                    40|
|       R1090|                    29|
|       R1318|                    15|
|        P287|                    43|
|        J689|                    31|
|       X2001|                    48|
+------------+----------------------+
only showing top 20 rows

In [68]:
busDf.groupBy("Town","School_Year").agg({"Busbreakdown_ID":"count"}).sort("Town").show()

+------------+-----------+----------------------+
|        Town|School_Year|count(Busbreakdown_ID)|
+------------+-----------+----------------------+
|All Boroughs|  2017-2018|                    60|
|All Boroughs|  2018-2019|                   174|
|All Boroughs|  2016-2017|                    88|
|All Boroughs|  2015-2016|                   183|
|All Boroughs|  2019-2020|                   129|
|       Bronx|  2019-2020|                 10445|
|       Bronx|  2018-2019|                 24124|
|       Bronx|  2015-2016|                 16292|
|       Bronx|  2016-2017|                 22351|
|       Bronx|  2017-2018|                 20944|
|    Brooklyn|  2015-2016|                 15249|
|    Brooklyn|  2016-2017|                 18952|
|    Brooklyn|  2018-2019|                 21679|
|    Brooklyn|  2019-2020|                 11065|
|    Brooklyn|  2017-2018|                 18964|
| Connecticut|  2015-2016|                    26|
| Connecticut|  2017-2018|                    66|
| Connecticut|  2018-2019|                    57|
| Connecticut|  2016-2017|                    72|
| Connecticut|  2019-2020|                    16|
+------------+-----------+----------------------+
only showing top 20 rows

In [70]:
busDf.groupBy("Route_Number","School_Year").agg({"Busbreakdown_ID":"count"}).sort("Route_Number").show()

+------------+-----------+----------------------+
|Route_Number|School_Year|count(Busbreakdown_ID)|
+------------+-----------+----------------------+
|        null|  2017-2018|                     7|
|          #2|  2019-2020|                     3|
|          #3|  2019-2020|                     2|
|           0|  2015-2016|                     1|
|           0|  2018-2019|                     1|
|       0101A|  2018-2019|                     6|
|       0101A|  2017-2018|                    20|
|       0101A|  2016-2017|                    10|
|       0101C|  2015-2016|                     1|
|       0102A|  2015-2016|                     9|
|       0102A|  2018-2019|                     1|
|       0102A|  2019-2020|                     1|
|       0102A|  2017-2018|                    15|
|       0102C|  2015-2016|                     1|
|       0103A|  2016-2017|                     8|
|       0103A|  2015-2016|                     2|
|       0103A|  2017-2018|                     2|
|       0103A|  2018-2019|                     1|
|       0103C|  2015-2016|                     1|
|       0104A|  2015-2016|                     1|
+------------+-----------+----------------------+
only showing top 20 rows

In [71]:
busDf.columns

['School_Year',
 'Busbreakdown_ID',
 'Run_Type',
 'Bus_No',
 'Route_Number',
 'Schools_Serviced',
 'Occurred_On',
 'Town']

In [75]:
busDf.filter(busDf["Town"]=="Manhattan").groupBy("School_Year","Town")\
.agg({"Busbreakdown_ID":"count"}).sort("School_Year").show()

+-----------+---------+----------------------+
|School_Year|     Town|count(Busbreakdown_ID)|
+-----------+---------+----------------------+
|  2015-2016|Manhattan|                 11339|
|  2016-2017|Manhattan|                 16183|
|  2017-2018|Manhattan|                 23931|
|  2018-2019|Manhattan|                 34726|
|  2019-2020|Manhattan|                 13294|
+-----------+---------+----------------------+